tests/ldc_test_ascii/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       760;
    }
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       780;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       800;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       820;
    }
    back0
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       840;
    }
    front1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       1240;
    }
)

// ************************************************************************* //
